#为方便查询，使用字典来保存数据，
#用准考证号字段作为键，其他字段定义为字典作为值。
d={"010607":{'姓名':'吴姣','性别':'女','专业':'学前教育'},
   "010704":{'姓名':'张思思','性别':'女','专业':'学前教育'},
   "070321":{'姓名':'蔡鸿羽','性别':'男','专业':'电气自动化技术'},
   "180422":{'姓名':'甘雨婷','性别':'女','专业':'电气自动化技术'},
   "011102":{'姓名':'陈鹏涛','性别':'男','专业':'电子商务'},
   "070220":{'姓名':'杜建辉','性别':'男','专业':'电子商务'}}
import pickle	#使用pickle模块从文件读写对象
f=open('data7-2.dat','wb')   #使用二进制文件存储对象
pickle.dump(d,f)		#将字典对象写入文件
f.close()
print('数据已存入文件：data7-2.dat')
f=open('data7-2.dat','rb')   #以二进制格式打开文件，读数据
ds=pickle.load(f)                #读出字典对象
f.close()
x=input('请输入学号：')
if x in ds:
    xb='{1:{0}<4}{2:{0}<3}'.format(chr(12288),'姓名','性别')
    print('%-6s'%'准考证号',xb,'专业')
    a=ds[x]
    xb='{1:{0}<4}{2:{0}<3}'.format(chr(12288),a['姓名'],a['性别'])
    print('%-10s'%x,xb,a['专业'])
else:
    print('未找到学号：%s 匹配的学生数据！'%x)
